stress/message/POST.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 1
scenarios: 
  - flow:
      - post:
          url: "http://localhost:4000/messages/edit/faultyID"
          json:
                sender: "5ffb4dbeee35744495bf58fc"
                message: "editted content"
          expect:
            statusCode: 500